app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2018-07-24 18:46:55.724351"], ["updated_at", "2018-07-24 18:46:55.724351"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-07-24 18:46:55.726594"], ["updated_at", "2018-07-24 18:46:55.726594"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      Song.create(title: song[0])
      Artist.create(name: song[1])